<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Objectives" data-toc-modified-id="Objectives-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Objectives</a></span></li><li><span><a href="#SQL-Subqueries" data-toc-modified-id="SQL-Subqueries-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>SQL Subqueries</a></span><ul class="toc-item"><li><span><a href="#Subqueries-in-FROM" data-toc-modified-id="Subqueries-in-FROM-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Subqueries in <code>FROM</code></a></span></li><li><span><a href="#Note:-Subqueries-are-Like-New-Tables!" data-toc-modified-id="Note:-Subqueries-are-Like-New-Tables!-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Note: Subqueries are Like New Tables!</a></span></li><li><span><a href="#Subqueries-in-WHERE" data-toc-modified-id="Subqueries-in-WHERE-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Subqueries in <code>WHERE</code></a></span></li><li><span><a href="#Level-Up:-Common-Table-Expressions" data-toc-modified-id="Level-Up:-Common-Table-Expressions-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Level Up: Common Table Expressions</a></span><ul class="toc-item"><li><span><a href="#Exercise" data-toc-modified-id="Exercise-2.4.1"><span class="toc-item-num">2.4.1&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li></ul></li><li><span><a href="#SQL-Versions" data-toc-modified-id="SQL-Versions-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>SQL Versions</a></span><ul class="toc-item"><li><span><a href="#SQL-Dialects" data-toc-modified-id="SQL-Dialects-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>SQL Dialects</a></span></li><li><span><a href="#SQLite-Pros-&amp;-Cons" data-toc-modified-id="SQLite-Pros-&amp;-Cons-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>SQLite Pros &amp; Cons</a></span><ul class="toc-item"><li><span><a href="#Pros" data-toc-modified-id="Pros-3.2.1"><span class="toc-item-num">3.2.1&nbsp;&nbsp;</span>Pros</a></span></li><li><span><a href="#Cons" data-toc-modified-id="Cons-3.2.2"><span class="toc-item-num">3.2.2&nbsp;&nbsp;</span>Cons</a></span></li></ul></li><li><span><a href="#Extra-Resources:-SQL-Versions" data-toc-modified-id="Extra-Resources:-SQL-Versions-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Extra Resources: SQL Versions</a></span></li></ul></li><li><span><a href="#Web-Databases:-data.world" data-toc-modified-id="Web-Databases:-data.world-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Web Databases: data.world</a></span><ul class="toc-item"><li><span><a href="#Step-1:-Create-a-data.world-account" data-toc-modified-id="Step-1:-Create-a-data.world-account-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Step 1: Create a data.world account</a></span></li><li><span><a href="#Step-2:-Create-a-project-using-this-Austin-AirBnB-dataset" data-toc-modified-id="Step-2:-Create-a-project-using-this-Austin-AirBnB-dataset-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Step 2: Create a project using this <a href="https://data.world/jonloyens/inside-airbnb-austin" target="_blank">Austin AirBnB</a> dataset</a></span></li><li><span><a href="#Step-3:-Create-a-SQL-query" data-toc-modified-id="Step-3:-Create-a-SQL-query-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Step 3: Create a SQL query</a></span></li><li><span><a href="#Step-4:-Run-a-simple-SQL-query" data-toc-modified-id="Step-4:-Run-a-simple-SQL-query-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>Step 4: Run a simple SQL query</a></span></li><li><span><a href="#Step-5:-Practice-using-SQL-to-explore-the-data" data-toc-modified-id="Step-5:-Practice-using-SQL-to-explore-the-data-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>Step 5: Practice using SQL to explore the data</a></span><ul class="toc-item"><li><span><a href="#Exercise-1:-Create-a-table-showing-the-number-of-listings-in-each-neighborhood" data-toc-modified-id="Exercise-1:-Create-a-table-showing-the-number-of-listings-in-each-neighborhood-4.5.1"><span class="toc-item-num">4.5.1&nbsp;&nbsp;</span>Exercise 1: Create a table showing the number of listings in each neighborhood</a></span></li><li><span><a href="#Exercise-2:-Create-a-table-showing-the-20-listings-with-the-most-reviews" data-toc-modified-id="Exercise-2:-Create-a-table-showing-the-20-listings-with-the-most-reviews-4.5.2"><span class="toc-item-num">4.5.2&nbsp;&nbsp;</span>Exercise 2: Create a table showing the 20 listings with the most reviews</a></span></li><li><span><a href="#Exercise-3:-Create-a-table-showing-all-of-the-reviews-for-listings-that-are-&quot;Bed-&amp;-Breakfast&quot;-property-types." data-toc-modified-id="Exercise-3:-Create-a-table-showing-all-of-the-reviews-for-listings-that-are-&quot;Bed-&amp;-Breakfast&quot;-property-types.-4.5.3"><span class="toc-item-num">4.5.3&nbsp;&nbsp;</span>Exercise 3: Create a table showing all of the reviews for listings that are "Bed &amp; Breakfast" property types.</a></span></li><li><span><a href="#Exercise-4:-Run-your-own-query-using-a-subquery-or-CTE." data-toc-modified-id="Exercise-4:-Run-your-own-query-using-a-subquery-or-CTE.-4.5.4"><span class="toc-item-num">4.5.4&nbsp;&nbsp;</span>Exercise 4: Run your own query using a subquery or CTE.</a></span></li></ul></li></ul></li></ul></div>

In [5]:
# Imports
import sqlite3
import pandas as pd

# Objectives

- Use SQL subqueries to nest queries
- Identify common SQL dialects and tools
- Query data from web databases

# SQL Subqueries

Like you might nest one function within another in Python, you can nest queries in SQL. We can use a **subquery** within another query to succinctly implement queries that have multiple query steps.

In [2]:
# Create the connect to the flights.db database
con = sqlite3.connect('./data/flights.db')

In [3]:
cursor = con.cursor()

In [6]:
pd.read_sql('''
SELECT *
FROM airports
LIMIT 2
''',
con)

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby
1,1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.7887,20,10,U,Pacific/Port_Moresby

In [15]:
# get the average altitiude of the highest altitiude airports in United States, Russia, China
# first filter airports on country
sq1 = pd.read_sql('''
SELECT
    *
FROM
    airports
WHERE
    country IN ('United States', 'Russia', 'China')
''',
con)
#step 2, use filtered table via subquery and get max altitude by country
sq2 = pd.read_sql('''
SELECT
    cf.name,
    cf.city,
    MAX(CAST(altitude AS int)) AS maxalt
FROM
    (SELECT
    *
    FROM
        airports
    WHERE
        country IN ('United States', 'Russia', 'China')) AS cf
GROUP BY
    country
''',
con)
#Use filtered table via subquery to average maxalts
sq3 = pd.read_sql('''

SELECT
    AVG(maxalt) AS maxalt_avg
    
FROM
    (SELECT
        cf.name,
        cf.city,
        MAX(CAST(altitude AS int)) AS maxalt
    FROM
        (SELECT
        *
        FROM
            airports
        WHERE
            country IN ('United States', 'Russia', 'China')) AS cf)
''',
con)

In [13]:
sq1

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,318,6891,Putnam County Airport,Greencastle,United States,4I7,\N,39.6335556,-86.8138056,842,-5,U,America/New_York
1,1104,6890,Dowagiac Municipal Airport,Dowagiac,United States,C91,\N,41.9929342,-86.1280125,748,-5,U,America/New_York
2,1121,6889,Cambridge Municipal Airport,Cambridge,United States,CDI,\N,39.9750278,-81.5775833,799,-5,U,America/New_York
3,1470,6885,Door County Cherryland Airport,Sturgeon Bay,United States,SUE,\N,44.8436667,-87.4215556,725,-6,U,America/Chicago
4,1507,6884,Shoestring Aviation Airfield,Stewartstown,United States,0P2,\N,39.7948244,-76.6471914,1000,-5,U,America/New_York
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2160,8079,9514,Ferry Terminal,Valdez,United States,None,VLDZ,61.123976,-146.365309,0,-9,A,America/Anchorage
2161,8090,9525,Ferry Dock,Bainbridge Island,United States,None,BAIN,47.622237,-122.509362,0,-8,A,America/Los_Angeles
2162,8098,9533,Chatsworth Station,Chatsworth,United States,CWT,\N,34.256944,-118.598889,978,-8,A,America/Los_Angeles
2163,8105,9540,Deer Harbor Seaplane,Deer Harbor,United States,DHB,\N,48.618397,-123.00596,0,-8,A,America/Los_Angeles
2164,8106,9541,San Diego Old Town Transit Center,San Diego,United States,OLT,\N,32.7552,-117.1995,0,-8,A,America/Los_Angeles

In [14]:
sq2

              name       city  maxalt
0  Yading Daocheng   Daocheng   14472
1        Irkutsk-2    Irkutsk   13411
2        Silverton  Silverton    9308

In [12]:
sq3

   maxalt_avg
0     14472.0

## Subqueries in `FROM`

You can use a subquery in the `FROM` clause - this is useful, for example, if you want to apply multiple aggregation functions.

Let say we want to get the average of the number of routes departing from all airports. First we'd need to get the total number of routes departing from all airports, then take the average.

In [17]:
# Get the number of departures
departure_table = pd.read_sql('''
SELECT
    source,
    COUNT()
FROM
    routes
GROUP BY
    source
''',
con)
departure_table

     source  COUNT()
0       AAE        9
1       AAL       20
2       AAN        2
3       AAQ        3
4       AAR        8
...     ...      ...
3404    ZUH       60
3405    ZUM        2
3406    ZVK        3
3407    ZYI       15
3408    ZYL        4

[3409 rows x 2 columns]

In [18]:
arrival_table = pd.read_sql('''
SELECT
    dest,
    COUNT()
FROM
    routes
GROUP BY
    source
''',
con)
arrival_table

     dest  COUNT()
0     ALG        9
1     AMS       20
2     CCJ        2
3     DME        3
4     AAL        8
...   ...      ...
3404  CZX       60
3405  YWK        2
3406  BKK        3
3407  KMG       15
3408  DAC        4

[3409 rows x 2 columns]

We can use this query as a subquery, and take the average of the new `number_of_departures` column.

In [ ]:
# Get the average via a subquery

## Note: Subqueries are Like New Tables!

If you squint, you'll notice that the subquery is taking the place of where we might put a table!

For example, checkout the SQL we wrote in our first subquery example:

```sql
SELECT 
    AVG(number_of_departures)
FROM (
    SELECT 
        source AS depart_airport
        ,COUNT() AS number_of_departures
    FROM
        routes
    GROUP BY
        source
)
```

We could imagine that some new table that returned by the subquery existed (let's call it `airport_departures`) and be placed in place of the subquery:

```sql
SELECT 
    AVG(number_of_departures)
FROM (
    airport_departures -- Replacing subquery with this hypothetical table
) 
```

You can actually use syntax close to this with **Common Table Expressions (CTEs)** found in the [Level Up section](#Level-Up:-Common-Table-Expressions) below.

## Subqueries in `WHERE`

You can use a subquery in the `WHERE` clause - this is useful, for example, if you want to filter a query based on results from another query.

Let's say that we want to get a table with all of the departures and destinations for the flight routes, but I only want to include flights departing from the five countries with the most airports.

To do this, we'd first need to identify the five countries that have the most airports.

In [ ]:
# get top 5 countries

I could enter these results into a new query of the routes table to get the data I want.

In [ ]:
pd.read_sql('''
SELECT 
    rt.source AS depart_airport,
    rt.dest AS destination_airport,
    ap.country AS depart_country
FROM
    routes AS rt
    LEFT JOIN airports AS ap
        ON rt.source_id = ap.id
WHERE 
    ap.country IN (
        "United States", 
        "Canada", 
        "Germany", 
        "Australia", 
        "Russia"
    )
ORDER BY 
    depart_country
''', conn)

This approach works but has a few limitations:

- We have to manually enter the countries to filter them
- The list of countries won't update with our data, so we'd have to monitor and manually change them in the future
- We have to look at two separate queries to understand what our code is supposed to do
- We have to run two separate queries, which might take longer than one combined query

A better solution uses a subquery to get the list of 5 countries and feed it into our WHERE clause.

In [ ]:
# Do it with a subquery!


## Level Up: Common Table Expressions

Common Table Expressions (CTEs) are a more readable way to implement subqueries, using `WITH` and `AS`.

In [ ]:
# Create a CTE

### Exercise

Create a table listing all airlines that serve the three airports with the most outbound routes.

In [ ]:
## Your work here

# SQL Versions

There is no one version of SQL - there are many versions out there! What you're learning about SQL with SQLite will apply to all of them. Just keep in mind when you apply for jobs that you may see any of these listed in any given job posting, and they are all just different versions of what you know.

## SQL Dialects

As with dialects of spoken languages, SQL dialects have many commonalities but some differences in syntax and functionality.  Here are a few of the major players:

- SQLite (we've already seen this!)
- PostgreSQL (free and open-source!)
- Oracle SQL
- MySQL (half open-souce, half Oracle)
- Microsoft SQL Server
- Transact-SQL (extends MS SQL)

## SQLite Pros & Cons

We use SQLite in this course, but it has some limitations.

### Pros

- Easy to set up
- Easy to share database files
- Uses little memory

### Cons

- Limited functionality for managing users and access permissions
- Not "thread safe": two edits at the same time can mess up your data

## Extra Resources: SQL Versions

[What Is a SQL Dialect, and Which one Should You Learn?](https://learnsql.com/blog/what-sql-dialect-to-learn/)

[SQLite vs MySQL vs PostgreSQL](https://www.digitalocean.com/community/tutorials/sqlite-vs-mysql-vs-postgresql-a-comparison-of-relational-database-management-systems)

[SQL Dialect Reference](https://en.wikibooks.org/wiki/SQL_Dialects_Reference)

# Web Databases: data.world

For the rest of this lesson, we'll be exploring databases in [data.world](https://data.world/), a web database that we can query using SQL in our browser. For reference, you can see the instructions for creating a new project here: [Getting Started Working with Data at data.world](https://help.data.world/hc/en-us/articles/360008853693-Getting-started-guide#working_with_data)

## Step 1: Create a data.world account

You will need to enter and verify your email address.

## Step 2: Create a project using this [Austin AirBnB](https://data.world/jonloyens/inside-airbnb-austin) dataset

Navigate to [this page](https://data.world/jonloyens/inside-airbnb-austin) and use the button at the top right of the page to create a new project using the data.

![](./images/data_world_austin_airbnb_new_proj.png)

## Step 3: Create a SQL query

In your project, use the "+ Add" button to add a SQL query.

![](./images/data_world_add_sql_query.png)

## Step 4: Run a simple SQL query

Try entering "SELECT * FROM listings" and clicking the "Run Query" button in the top right.


## Step 5: Practice using SQL to explore the data

Below are some exercises to practice your SQL skills and help explore the data. You will need to explore the table schemas to complete these exercises. 

You may find it helpful to click on the corresponding .csv files to inspect the data, or look at the columns in each table in the right sidebar.

### Exercise 1: Create a table showing the number of listings in each neighborhood

### Exercise 2: Create a table showing the 20 listings with the most reviews

### Exercise 3: Create a table showing all of the reviews for listings that are "Bed & Breakfast" property types.

### Exercise 4: Run your own query using a subquery or CTE.

Note that the syntax and functionality for subqueries and CTEs in data.world are more limited than SQLite, so try creating simple ones.